{"/glossary":{"data":{},"title":"Glossary"},"/puzzles/":{"data":{"":"Photo by Colin Osborne on Unsplash. (Under construction)"},"title":"Gnome puzzles"},"/tides/":{"data":{"":"Photo by Trevor Vannoy on Unsplash. Most people know two things about tides; they come in and out twice a day, and they have something to do with the moon.\nBut how do tides actually work? This question turns out to have a complicated answer, and one which is both badly explained and poorly understood.\nIf you are curious about tides, and find the common tidal explanations to be unsatisfying and confusing (like myself), then I hope that the following pages will provide you with clarity and understanding.\n1. Why are tides so confusing? 2. Forces"},"title":"How do tides work?"},"/tides/forces/":{"data":{"":"None of the illustrations in these pages are to scale. For example, the Moon will be shown much closer to Earth than it is in reality. The illustrations are scaled to aid understanding, and because scale diagrams would look ridiculous. In order to properly understand tides, it is necessary to start with the fundamentals and work up. In physics, you cannot get much more fundamental than forces. It may be that you already have an idea in your head of what forces are, and are tempted to skip ahead, but I encourage you to persevere. This section will start simple, but get tricky fast.\nForce basics What is a force? A force is an effect that causes an object to accelerate. “Acceleration” is a change in speed, direction of movement, or both.\nImagine a brick floating motionless in space. If a force is applied to that brick, then it will accelerate for as long as that force is applied, in the direction that the force is applied.\nAn initially stationary brick being acted on by a force. Unless otherwise stated, any arrows that appear in illustrations represent forces. Now imagine the brick is travelling to the right at a constant speed. There are no forces being applied to the brick, so it is not accelerating. It’s important to note that objects do not need to have forces acting on them for them to be moving. By contrast, objects that are accelerating must have forces acting on them.\nA brick in constant motion, in the absence of forces. That brick is now acted upon by a force pointing to the left. For the entire period that the force is acting on the brick, the brick is accelerating to the left. Often we think of acceleration as only happening in the direction of motion. Here, we have acceleration to the left while the brick is still moving to the right. Eventually, the acceleration causes the brick to start moving to the left.\nA brick initially in constant motion being acted on by a force. Newton’s second law We can write down an equation which describes how forces and objects interact:\nforce=mass×acceleration \\text{force} = \\text{mass} \\times \\text{acceleration} force=mass×accelerationThis is known as Newton’s second law. It tells us that the force applied to an object is proportional to its acceleration; in other words, the bigger the force, the greater the acceleration. It also tells us that the mass of an object affects its acceleration. If the same force is applied to a car and a planet, then the car will accelerate much quicker than the planet.\nUp until now, the arrows in the illustrations have all been the same length. From now on, you will see different lengths - the longer the arrow, the stronger the force.\nThroughout these pages you will find optional sections like the one below. These sections offer extra information for those who are interested, but can be safely ignored. Optional: Newton’s second law Masses and forces etc. Resultant force Most of the time, more than one force is acting on an object. These forces can act with or against each other. For example, initially the block below has four forces acting on it but is still not accelerating. This is because the forces are all the same size and point in opposite directions to each other, so their effects are balanced. After a few seconds the strengths of the forces change, and the block begins to accelerate and move in different directions.\nA brick initially being acted on by multiple forces. When many forces are acting on an object, it can be hard to understand what the overall effect of those forces is. The best way to make this clearer is to find the sum of the forces - the resultant force. To add forces together, the individual force arrows can be drawn nose-to-tail. The resultant force can then be drawn as an arrow from the base of the first force to the tip of the last force.\nThe animation below shows exactly the same motion as the animation above. The only difference is that the forces have been drawn nose-to-tail in order to show the resultant force, the overall effect of the combined forces. This is an effective way of simplifying a physics problem; instead of considering four forces, we can instead think about a single equivalent force.\nThe resultant force on the brick. #todo label arrows\nIt might seem obvious, but it’s important to understand that the resultant force is not a new, separate force. We have simply rearranged existing forces in order to make things simpler. The “observer”","detecting-forces#Detecting forces":"","force-basics#Force basics":"","newtons-second-law#Newton\u0026rsquo;s second law":"","resultant-force#Resultant force":"","the-observer#The \u0026ldquo;observer\u0026rdquo;":"","what-is-a-force#What is a force?":""},"title":"2. Forces"},"/tides/tidal_confusion/":{"data":{"":"If you Google “how do tides work?”, then you will come across a large number of explanations. NASA, Neil deGrasse Tyson, the BBC, and various surfing, fishing, and watersports websites have all had a go at it. In addition, forum sites like Reddit and Stack Overflow are filled with posts asking for help understanding tides, which ellicit varied and contradictory responses.\nMost of these explanations are, at best, misleading, and at worst, factually wrong. But what is it that these explanations fail to explain properly?\nThe single-bulge model The following tidal explanation involving bulges is introduced simply to show you how tides are commonly explained. You should not use it as a basis of your understanding of tides - that will come in later sections. Imagine a situation where the Earth is a perfect sphere and is very far away from anything else. This Earth is motionless, except that it spins once per day. Imagine that the planet is completely encased in water, which is held against the surface by the Earth’s gravity. The water does not spin with the Earth; it is completely stationary, while the Earth spins inside it. In this case, the depth of the water will be the same everywhere, and there will be no tides.\nThe Earth spinning inside stationary water. Now imagine that the Moon is slowly traveling around the Earth, completing about one orbit each month. Like the Earth, the Moon has a gravitational field which attracts the water. The water closest to the Moon is affected the most, and is pulled towards the Moon so that it forms a bulge. As each point on the Earth’s surface rotates through the bulge, the water level at that point rises and falls. This results in high and low tides.\nThe Moon's gravity causing a water bulge on the near side of the Earth. However, there is a big problem with the single-bulge model. The Earth spins once a day, while the bulge slowly progresses around the Earth in the same direction - this means that one high tide and one low tide occur in the span of around 25 hours. But in real life, two high tides and two low tides occur in this time. If you have spent time near the coast, then you probably will have noticed two high tides each day. Therefore, the single-bulge model does not make sense.\nThe double-bulge model In order to fix the model, we must add second bulge opposite the first one. With two bulges, the Earth rotates through two tidal cycles in 25 hours, which matches real life!\nThe double-bulge model. Almost any explanation of tides will include a prominent image of the double-bulge model. But what causes the second bulge? Unlike the first bulge, which is intuitively explained via the Moon’s gravity, the second bulge is not easily justified. The second bulge is, without doubt, the biggest source of confusion and disagreement surrounding online tidal discussions.","the-aims-of-this-site#The aims of this site":"In my experience, descriptions of tidal mechanics are either:\noverly simplified and absent of important details, leading to misconceptions; aimed at a professional scientific audience and so skip the fundamentals, making them impenetrable to most people. This site aims to find a middle ground. It will assume minimal knowledge of physics and maths, but will go much further than the surface-level tidal explanations you will find on Google. The intended audience is anyone with a curiosity about tides, regardless of prior knowledge.\nA common feature of poor science explanations is that they will lie to you in order to make things simpler. Here is my promise to you: I will not lie to you unless I have first told you that I am lying.\nThese pages will proceed as follows: first, you will learn about forces, gravity, and planets. Then, we will apply this knowledge to the double-bulge model, in order to explain where the second bulge comes from. Finally, the double-bulge model will be put into context with other tidal effects, in order to give a fuller picture of tides.\nPlease read on!\nIf you have a solid foundation in physics, then you may wish to skip straight to #todo rather than follow the sections sequentially. This is not recommended, however.","the-double-bulge-model#The double-bulge model":"","the-single-bulge-model#The single-bulge model":"","what-causes-the-second-bulge#What causes the second bulge?":"If the first bulge and the second bulge are compared, it would appear as though the second bulge is caused by an effect similar to the Moon’s gravity, but acting in the opposite direction. The range of explanations for this effect include:\ncentrifugal or centripetal or inertial forces; water sloshing about, like in a bathtub; the sun. These have varying values of correctness or relevance. Of this list, by far the most commonly mentioned phrase in tidal discourse is “centrifugal force”. You will find this phrase in many official-looking places, including textbooks and encyclopedias. And yet, if you only learn one thing from this site, it should be that centrifugal force is not the cause of any tidal effects. In fact, centrifugal force is not the “cause” of anything, as you will learn later. If you hear someone mentioning centrifugal force then you should challenge them to explain what it means; most people have no idea.\nBut the question still remains; what causes the second bulge? That is the question that the following sections will attempt to answer."},"title":"1. Why are tides so confusing?"},"/tunelist/":{"data":{"":"Photo by Joel Timothy on Unsplash. This is a personal store of traditional tunes I’ve learned, intended as a way to quickly reference them. There is a lot of overlap with places like The Session, but also more unique tunes that I’ve come across. You can use the panels below to filter which tunes to show in the table, and clicking on a tune will display the sheet music. This is built with DataTables and ABCjs.\nTitle Type Time Time Unit Key Composer Source ABC Arthur Darley's Swedish Jig 6/8 1/8 D Arthur Darley Craig Harrison e|:fgf edc|d2A BAG|FED EDC|DA,B, CDE|\\nDdd Aee|Aff Agg|fed edc|1 d3 d2e:|2 d3 d=c_B||\\n|:A2=f fef|A2=f fef|A=ff Agg|Aaa A_bb|\\nA2=f fef|A2=f feg| fed edc|1 d3 d=c_B:|2 d3 d2|] Clueless Reel 4/4 1/8 Em Gordon Duncan Gordon Duncan's Tunes |:Beed efge|f2 df edBA|Bd ~d2 dBAB|d2 AB dABd|\\nBeed efge|f2 df edBA|Bd ~d2 dBAB|1 d2 fd e3 d:|2 d2 fd e3 f||\\n|ge~e2 ae~e2|geae ge~e2|fdec dBAB|d2 fd Adfd|\\nge~e2 ae~e2|geae ge~e2|fdec dBAB|d2 fd e3 f|\\ngeea eege|eaee ge~e2|fdec dBAB|d2 fd Adfd|\\ngeea eege|eaee ge~e2|fdec dBAB|d2 fd e3 d|] \\n AJ's Jig 6/8 1/8 E Ian Lothian https://thesession.org/tunes/10738 |:~g3 fef|gfe cBc|ecB GFE|F2E CB,C|\\n~E3 FEc|Bce gfe|f2B BcB|1 bBc def:|2 bBc deg||\\n|:f2 e- ede|d2 c- cde|Bce GFE|F2E CB,C|\\n~E3 FEc|Bce gfe|fge ceB|1 bBc deg:|2 bBc def|] \\n Gentle Milkmaid, The Reel 4/4 1/8 Bm Trad. Alison Mackenzie |:B2d2 cBBc|B2d2 feef|B2d2 cBBd|cA~A2 fe ef:|\\n|:d2 fe dBAB|d2af feef|d2 fe dBBd|cA~A2 fe ef:| \\n Con Carthy's Slide 12/8 1/8 Bm Trad. Craig Harrison |:B2A Bcd B2A F2A|~B3 Bcd efe d2c|B2A Bcd B2A F2G|A2F DEF E6:|\\n|:f2e d2c B2A F2A|f2e def e3 efg|f2e d2c B2A F2G|A2F DEF E6:|]\\n Apsley Cottage Jig 6/8 1/8 F#m Colin Farrell Graham Mackenzie |:c3 cBc|ecA Bec|F3 FEF|Aec B2A|\\nc3 cBc|ecA Bec|F2E F2a|fec B2A:|\\nF3 FEF|ABc c2B|ABA ABc|B2A BAE|\\nF3 FEF|ABc c2B|ABA Aag|fec B2A|\\nF3 FEF|ABc c2B|ABA ABc|B2A Bce|\\na2 g- gag|fec fec|B3 BAB|cag f2e|] \\n Hold Up the Sky Jig 6/8 1/8 F#m Brian Finnegan Jamie Quinn |:FAB c2B | ABc- cBA | B2c e2c | f2e cBA |\\nFAB c2B | ABc- cBA | B2A F2E |1 F3 F2E :|2 F3 F2C ||\\n|: D2F FEF | A2F D2C | B,2F FEF | B2A F2C |\\n[1 EFF FEC | EFF FEF | AFA BAB | ~c3 c2C :| \\n[2 AEF- FEF | AEF- FEF | AFA BAB | ~c3 c2E |]"},"title":"Tune List"}}